Revit 2024 API
UIView Class
 A class containing data about view windows in the Revit user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class UIView : IDisposable
Visual Basic
Public Class UIView _
	Implements IDisposable
Visual C++
public ref class UIView : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIView
See Also
UIView Members
Autodesk.Revit.UI Namespace